Catalogs/ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Р_ВходящиеСообщения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылаОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Свойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОтправкаСообщений/Ext/Module.bsl
Процедура ПоФИФОИзОчередиИсходящих() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		ЗаписьЖурналаРегистрации("ОтправкаСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
	КонецЕсли;
	
	//Белов
	Если Не Константы.AMQP_ВыгружатьДанные.Получить() Тогда
		Возврат;
	КонецЕсли;
	//Белов
	
	Результат = ПолучитьЭлементыКОотправке();
	
	ВыборкаТочкаПубликации = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТочкаПубликации.Следующий() Цикл
		
		Издатель = ОчередьСообщений.НовыйАдресныйИздатель(ВыборкаТочкаПубликации.ТочкаПубликации);
		Выборка = ВыборкаТочкаПубликации.Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
				Блокировка = Новый БлокировкаДанных;
				Элемент = Блокировка.Добавить("Справочник.ИсходящиеСообщения");
				Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
				
				НачатьТранзакцию();
				
				Блокировка.Заблокировать();
				ДатаВремяОтправки = ПолучитьЗначениеРеквизитаСсылкиЧерезТочку(Выборка.Ссылка, "ДатаВремяОтправки");
				
				Если Не ЗначениеЗаполнено(ДатаВремяОтправки) Тогда					
					ЗаписатьДатуОтправкиСообщения(Выборка.Ссылка);
					//Белов добавил передачу нового параметра
					Издатель.ОтправитьСообщение(Выборка.Ссылка, Выборка.Сообщение, Выборка.КлючМаршрутизации); 									
				КонецЕсли;
				
				//Белов
				Если Не ЗначениеЗаполнено(Выборка.Ссылка.Сообщение) Тогда
					ОтменитьТранзакцию();
				Иначе
					ЗафиксироватьТранзакцию();
				КонецЕсли;
				//Белов

			Исключение
				
				//Белов
				AMQP_РаботаСДокументами.ОповеститьСерверМониторинга(Ложь,Истина,Выборка.Ссылка);
				//Белов;
				
				ТекстОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации(
				"ОтправкаСообщений.Ошибка",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ТекстОшибки);
				ОтменитьТранзакцию();
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;   
КонецПроцедуры	

Функция ПолучитьЭлементыКОотправке()

	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходящиеСообщения.КлючМаршрутизации,
	|	ИсходящиеСообщения.ТочкаПубликации КАК ТочкаПубликации,
	|	ИсходящиеСообщения.Сообщение,
	|	ИсходящиеСообщения.Ссылка КАК Ссылка,
	|	ИсходящиеСообщения.ДатаВремяСобытия
	|ИЗ
	|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
	|ГДЕ
	|	ИсходящиеСообщения.ДатаВремяОтправки = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ИсходящиеСообщения.ПометкаУдаления
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Справочник.ИсходящиеСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаПубликации,
	|	ИсходящиеСообщения.ДатаВремяСобытия
	|ИТОГИ ПО
	|	ТочкаПубликации";
	
	Результат = Запрос.Выполнить();
	
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;

КонецФункции // ПолучитьЭлементыКОотправке()

Процедура ЗаписатьДатуОтправкиСообщения(СообщениеСсылка)
	ОбъектСсылка = СообщениеСсылка.ПолучитьОбъект();
	ОбъектСсылка.ДатаВремяОтправки = ОчередьСообщенийВызовСервера.ТекущаяДатаНаСервере();
	ОбъектСсылка.Записать();
КонецПроцедуры	

Функция ПолучитьЗначениеРеквизитаСсылкиЧерезТочку(Ссылка, КолонкаЗначения)
	
	Значение = Неопределено;
	
	ИмяМетаданного = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ т." + КолонкаЗначения + " Как Значение
		| ИЗ " + ИмяМетаданного + " Как т 
		| ГДЕ т.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Значение = Выборка.Значение;
	КонецЕсли;
		
	Возврат Значение;
	
КонецФункции
